{
    "latest": 80,
    "version": "1.19 Release",
    "updateurl":"https://raw.githubusercontent.com/aziatka/admin_app_release/main/Arizona%20RP/arztools.luac",
    "patch_load": false,
    "critical": true,
    "event": false,
    "changes": [
        "Добавлена система привязки вашего аккаунта Вконтакте через наш новый сайт. Подробнее можно узнать в наших официальных источниках",
        "Система облачного сохранения резервных копий настроек скрипта. Теперь ваши настройки никуда не пропадут после переустановки скрипта!",
        "Система личных бейджиков. В профиле на главной странице скрипта появился раздел с вашими специальными значками, которые вы можете получить за разные достижения и заслуги",
        "Система защиты от нежелательных регистраций (/regbot) значительно улучшена. Теперь настройка осуществляется через диалоговое окно, в котором можно добавить до пяти разных паттернов для поиска никнеймов и каждому назначить свою причину блокировки",
        "Обновлена система админ-форм. Теперь их настройка более понятна, а также добавлена возможно выбрать для каких команд включать пред-рекон, а для каких нет. Помимо этого теперь вам не придётся ждать следующего обновления, чтобы в скрипте появилась поддержка какой-либо новой формы, мы можем делать это “дистанционно”. Добавлена поддержка формы /sbanip",
        "Для мониторинга организаций добавлена новая настройка отображения - только если лидер организации в сети. Это значит, что организация будет отображаться только в том случае, если она выбрана в настройках и её лидер находится в игре",
        "Для компактного режима мониторинга организаций добавлена возможность изменить режим отображения заместителей - списком ID заместителей в сети или их количество",
        "Так же для мониторинга организаций добавлены функции отображения общего количества лидеров или заместителей в сети. Учитываются только руководители выбранных организаций.",
        "Выбор способа спавна через /gc после авторизации в /apanel отключён для 1-2 уровней",
        "Для дальнего чата добавлена настройка отображения его при слежке",
        "В раздел правил добавлена возможность посмотреть FAQ по использованию специальных возможностей редактора",
        "В /agun добавлена поддержка выдачи «Золотого длинного дигла» (ID: 72)",
        "Теперь можно упоминать сразу несколько уровней одним пингом. Например: @1-2lvl (упомянет всех хелперов) или @4+lvl (упомянет всех администраторов, чей уровень 4 или выше)",
        "Добавлена возможность настройки времени после которого будут запрашиваться опровержения со слётов",
        "Для команд /checkpunish и /getwarn добавлена авто-подстановка ID, если команда была введена в реконе за игроком и без указания ID",
        "Для команды /checkpunish добавлено сокращение - /cp",
        "Команды /goh и /gob теперь доступны только с 4-го уровня, а так же отключена работа клавиш (стрелок), находясь в меню паузы",
        "Теперь аргумент типа отправки /pm не обязателен. Если его не указывать сообщение автоматически отправится в чат игроку. Например: /pm Roy_Shelby привет!",
        "Теперь находясь в слежке за игроком если за ним следят другие и администраторы, то над панелью информации появится счётчик наблюдателей",
        "Обновлена система смены погоды и времени. Теперь время и погода в интерьерах всегда остаётся серверным, а так же добавлена функция сброса значения погоды или времени на серверное.",
        "Добавлена команда /getskin, которая подскажет, название и ID надетого скина у игрока",
        "Исправлен баг, когда в чате иногда выводился /leaders или /zams при включенном мониторинге организаций и слабом интернет-соединении",
        "Исправлен баг, когда при выключенной автоматической авторизации в /apanel и включенным мониторингом организаций, скрипт флудил диалоговым окном ввода пароля /apanel",
        "Исправлен баг с иногда неверной выдачей оружия по названию через команду /agun",
        "Увеличены размеры скролл-бара в 2 раза для всех интерфейсов скрипта, ранее они были слишком узкие и попасть по ним было проблематично",
        "Интерфейс окна полезной информации (/admhelp) был немного изменён",
        "Для /getip теперь можно включить альтернативный метод проверки через другой сервис (/amenu - Основное). На наш взгляд он более конкретно определяет провайдера, но не отображает используется ли VPN или мобильный интернет",
        "Информация о провайдере в /getip теперь ограничена по длине",
        "Изменён стиль окон личных обращений от разработчиков",
        "Исправлен краш при ответе на репорт с привязанным к нему биндом",
        "Полностью переписана система сохранения ваших биндов, а так же теперь можно дать бинду любое название. Помимо этого исправлены некоторые незначительные баги",
        "Обновлён список доступных иконок в /fa. Теперь там доступно почти на 40% иконок больше от того что было ранее",
        "Исправлена проблема, когда скрипт мог иногда не засчитывать вычитание репутации в статистике",
        "Исправлены баги с ложным срабатыванием авто-опры на транспорт",
        "Теперь находясь на сервере Vice City к вашему тегу в формах будет добавляться номер сервера из ника",
        "Теперь слишком длинные названия транспортных средств в панели информации рекона обрезаются и не выходят за рамки. Узнать полное название можно просто наведясь курсором.",
        "Максимальное количество биндов в круге взаимодействия увеличено до 8 (было 6)",
        "Длинный ответ в репорт теперь делится на части по словам, а не по количеству символов",
        "Другие изменения в различных уголках скрипта, о которых не имеет смысла рассказывать, но которые вы обязательно заметите и они вам понравятся"
    ],
    "servers": [
        { "address": "185.169.134.3:7777", "id": 1 },
        { "address": "185.169.134.4:7777", "id": 2 },
        { "address": "185.169.134.43:7777", "id": 3 },
        { "address": "185.169.134.44:7777", "id": 4 },
        { "address": "185.169.134.45:7777", "id": 5 },
        { "address": "185.169.134.5:7777", "id": 6 },
        { "address": "185.169.134.59:7777", "id": 7 },
        { "address": "185.169.134.61:7777", "id": 8 },
        { "address": "185.169.134.107:7777", "id": 9 },
        { "address": "185.169.134.109:7777", "id": 10 },
        { "address": "185.169.134.166:7777", "id": 11 },
        { "address": "185.169.134.171:7777", "id": 12 },
        { "address": "185.169.134.172:7777", "id": 13 },
        { "address": "185.169.134.173:7777", "id": 14 },
        { "address": "185.169.134.174:7777", "id": 15 },
        { "address": "80.66.82.191:7777", "id": 16 },
        { "address": "80.66.82.190:7777", "id": 17 },
        { "address": "80.66.82.188:7777", "id": 18 },
        { "address": "80.66.82.168:7777", "id": 19 },
        { "address": "80.66.82.159:7777", "id": 20 },
        { "address": "80.66.82.200:7777", "id": 21 },
        { "address": "80.66.82.144:7777", "id": 22 },
        { "address": "80.66.82.132:7777", "id": 23 },
        { "address": "80.66.82.128:7777", "id": 24 },
        { "address": "80.66.82.113:7777", "id": 25 },
        { "address": "80.66.82.162:5125", "id": 101 },
        { "address": "80.66.82.148:5125", "id": 102 },
        { "address": "80.66.82.136:5125", "id": 103 },
        { "address": "80.66.82.147:7777", "id": 1000 }
    ],
    "files": {
        "gps": 17,
        "gps_vc": 5,
        "questions": 8,
        "server_cmd": 4,
        "admin_cmd": 6,
        "vehicles": 9,
        "skins": 7,
        "giveoff": 7
    },
    "api_url": "https://api.arztools.tech/"
}