{
	"latest": 70,
	"version": "1.16 Release",
	"updateurl":"https://raw.githubusercontent.com/aziatka/admin_app_release/main/Arizona%20RP/13_GG.luac",
	"patch_load": false,
	"critical": true,
	"changes": [
		"Проведён полный ребрендинг скрипта. 13=GG остаётся в прошлом, и теперь мы известны как «Arizona Tools» по-скольку отныне наш проект сотрудничает с Arizona Games. Всё остаётся как и было, меняется только название и логотип",
		"Добавлен раздел правил сервера. В нем Вы можете указать все правила своего сервера по разным разделам, а затем быстро и удобно находить нужный вам пункт и при надобности скопировать его в один клик",
		"Добавлен режим быстрого взаимодействия с игроками или транспортом через специальный круг. Подробнее в /amenu - Админ ПО - Круг взаимодействия",
		"Полностью обновлён блокнот (/note). Теперь он выглядит более удобным и интуитивно понятным",
		"Теперь вы можете написать «/spcarall last» и скрипт покажет, в какое время был последний общий спавн транспорта на сервере. Доступно с любого уровня",
		"Теперь если вы написали очень длинный ответ на репорт (более 85 символов), то не влезающая часть автоматически перенесётся игроку в /pm 0. Так же значительно увеличен системный лимит символов в строке ввода при ответе на репорт",
		"Добавлена команда для быстрого проникновения в транспорт - /entercar",
		"Теперь, когда в чате появляется форма на /plveh, то в конце неё, в скобках, пишется название транспорта, которое хочет выдать администратор",
		"Добавлена возможность изменять цвет сообщений в /pm. Сделать это можно в /amenu - Основное",
		"Добавлена команда для быстрого возвращения на свой сервер - /arz. Она может пригодится, если Вы по каким-то причинам застряли на Vice City (Например у вас нет аццепта)",
		"В список тегов для пользовательской настройки строки в админ чекере добавлен {spec_nick}, позволяющий получить ник игрока за которым ведётся слежка",
		"Изменена логика глобального курсора. Теперь Вам не нужно биндить его на кнопку, он активен всегда, когда активен обычный игровой курсор или курсор Windows. Это означает, что все чекеры которые имели свойство клика (админ чекер, килл-лист и т.п.) теперь работают от обычного курсора",
		"Вместо бинда на глобальный курсор добавлен бинд на открытие окна с полезной информацией (/admhelp)",
		"Чат для общения в реконе теперь можно не только изменить на /pm или /b, но и выключить полностью. Подробнее /amenu - Основное - Общение в слежке",
		"В анти-флуд добавлена поддержка НонРП рабочего чата, а так же теперь в теге варнинга указывается тип чата на который он сработал",
		"Добавлена возможность скрыть сообщения о заморозках/разморозках в админ чате (/amenu - Основное - Скрытие админ строк)",
		"В команде /gethere теперь можно указывать сразу несколько игроков, они будут телепортироваться по очереди",
		"Добавлен пред-просмотр карты гетто при наведении на одну из кнопок для расформирования территорий (/ghetto)",
		"Удалять игроков из чекера (/delplayer) теперь можно не только по нику, но и по ID",
		"Исправлен баг, когда при нажатии цифр 1/2/3 на клавиатуре без нажатия ALT скрипт автоматически отвечал на репорт",
		"Теперь клик по заголовку админ-чекера направит Вас в очередь слежки за всеми администраторами в сети. Аналогично работают скрытые пользователем списки администраторов (там, где отображается только число в сети на данном уровне)",
		"Добавлена возможность перейти в очередь слежки сразу за всеми игроками из чекера кликнув по его заголовку",
		"Команда /pbanip теперь банит по IP если ваш уровень 4 и выше",
		"В список поддерживаемых админ-форм добавлена команда /aunlock",
		"Улучшена команда /tpr: теперь при телепорте игрока, сидящего на пассажирском месте, будет телепортироваться водитель этого транспортного средства (при наличии)",
		"Добавлено запоминание установленных настроек для каждого типа действия в радиусе (/rkick, /rpm, /rslap, /rjail)",
		"В админ-формах команда /apunishoff перенесена с 4 лвл на третий",
		"Добавлена функция скрытия серверных часов над радаром если на Вас надет аксессуар «Часы». Найти можно в /amenu - Основное",
		"Теперь при слежке за игроком, в HUD-е будет отображаться колличество денег, которое у него на руках",
		"Исправлены некоторые баги с авто-вводом данных. Необходимо заполнить поля автоматических авторизаций по новой (/amenu - Основное)",
		"Убрано ложное срабатывание варнинга на ТК, если убийство произошло на мероприятии PUBG",
		"Изменена система упоминаний: добавлены альтернативные упоминания на русском, а так же теперь упоминание всех доступно любому уровню, а не только кураторам и выше",
		"Добавлено КД 10 секунд на упоминания в чате. Это означает, что если кто-то решит пофлудить @аll, то Вы получите только одно уведомление",
		"Исправлен баг, когда статистика онлайна (/online) в воскресенье показывала по нулям и «переходила» в предыдущую неделю",
		"Изменён стандартный цвет организации «Байкеры»",
		"Исправлена проблема когда при отправке формы /banoff, у других администраторов мог сработать варнинг о том, что форма на администратора и наблюдается попытка слива",
		"Теперь варнинги на рванку не срабатывают на администраторов",
		"Возможно исправлен баг, когда игрок выходил с сервера, но по прежнему оставался в чекере (аналогично с 5+ админами)",
		"Исправлены баги с админ-чекером при нестабильном интернет-соединении (обновлялся рывками или пропадала часть админов)",
		"Прочие незначительные улучшения"
	],
	"servers": [
		{ "address": "185.169.134.3:7777", "id": 1 },
		{ "address": "185.169.134.4:7777", "id": 2 },
		{ "address": "185.169.134.43:7777", "id": 3 },
		{ "address": "185.169.134.44:7777", "id": 4 },
		{ "address": "185.169.134.45:7777", "id": 5 },
		{ "address": "185.169.134.5:7777", "id": 6 },
		{ "address": "185.169.134.59:7777", "id": 7 },
		{ "address": "185.169.134.61:7777", "id": 8 },
		{ "address": "185.169.134.107:7777", "id": 9 },
		{ "address": "185.169.134.109:7777", "id": 10 },
		{ "address": "185.169.134.166:7777", "id": 11 },
		{ "address": "185.169.134.171:7777", "id": 12 },
		{ "address": "185.169.134.172:7777", "id": 13 },
		{ "address": "185.169.134.173:7777", "id": 14 },
		{ "address": "185.169.134.174:7777", "id": 15 },
		{ "address": "80.66.82.191:7777", "id": 16 },
		{ "address": "80.66.82.190:7777", "id": 17 },
		{ "address": "80.66.82.188:7777", "id": 18 },
		{ "address": "80.66.82.168:7777", "id": 19 },
		{ "address": "80.66.82.159:7777", "id": 20 },
		{ "address": "80.66.82.200:7777", "id": 21 },
		{ "address": "80.66.82.144:7777", "id": 22 },
		{ "address": "80.66.82.132:7777", "id": 23 },
		{ "address": "80.66.82.128:7777", "id": 24 },
		{ "address": "80.66.82.162:5125", "id": 101 },
		{ "address": "80.66.82.148:5125", "id": 102 },
		{ "address": "80.66.82.136:5125", "id": 103 },
		{ "address": "80.66.82.147:7777", "id": 1000 }
	],
	"files": {
		"gps": 9,
		"gps_vc": 4,
		"questions": 3,
		"server_cmd": 2,
		"admin_cmd": 3,
		"vehicles": 6,
		"skins": 3
	},
	"api_url": "https://api.arztools.tech/"
}
