{
    "latest": 74,
    "version": "1.17 Release",
    "updateurl":"https://raw.githubusercontent.com/aziatka/admin_app_release/main/Arizona%20RP/arztools.luac",
    "patch_load": false,
    "critical": false,
    "event": false,
    "changes": [
        "Добавлена возможность изменять дальность прорисовки никнеймов. Изменить этот параметр можно в настройках WallHack'а",
        "Добавлена возможность отключить синхронизацию денег игрока, за которым вы следите. Найти этот пункт можно в /amenu - Основное",
        "Стало возможным замутить администратора, чтобы он не смог упомянуть вас в чате. Сделать это можно через /amenu - Основное (рядом с настройками упоминаний)",
        "Возвращена возможность забиндить «Глобальный курсор». Клики по различным чекерам на экране теперь осуществляются только через него",
        "Добавлена команда /gettime [id/nick]. С её помощью вы сможете узнать местное время того или иного игрока",
        "Возвращена возможность копировать информацию из /admhelp просто кликнув на нужную строку",
        "Команда /aj теперь может принимать в себя аргумент - Ник или ID игрока, для быстрого открытия лога его сообщений",
        "В окне ответа на репорт кнопка «Сохранить репорт» изменена на «Выдать мут репорта» (Системы сохранения репорта в базу данных сервера уже давно нет)",
        "Теперь, при входе в рекон, находясь в AirBrak'e, его состояние будет сохраняться, и при выходе из слежки он по-прежнему будет работать",
        "В настройки админ-чекера, в пункт о слежке, добавлены параметры отвечающие за отображение ника или ID игрока, за которым следит администратор",
        "В настройки круга взаимодействия добавлена возможность изменять цвет для каждого из режимов",
        "В настройки админ-чекера, в пункт о АФК, добавлена возможность скрытия этого параметра если администратор не в АФК",
        "В настройки админ-чекера добавлена возможность отображать информацию о том, использует ли администратор Arizona Tools (Информация может обновляться не сразу)",
        "Если ваш уровень больше первого, то игроки в админ-чекере за которыми следят администраторы обновляются моментально",
        "Исправлен баг, когда флуд контроль на обычные сообщения не работал на сервере Vice City",
        "Теперь ник игрока, который вышел во время слежки на Vice City копируется с номером его сервера",
        "В чекер игроков рядом (/near) добавлена возможность включить отображение цветов ников их сортировку. Это поможет тщательнее контролировать стрелы и капты следящим",
        "В список сообщений которые можно скрыть добавлены варнинги на закладки (/amenu - Основное - Скрытие админ-строк)",
        "В обменник VC/SA долларов добавлен пункт, отображающий сколько вы максимально можете обменять денег",
        "Для админ-формы /uval добавлен предрекон перед выдачей",
        "Отключена «коллизия» у некоторых imgui-окон (принятие формы, ловля репорта, статистика и т.п.). Теперь курсор работает даже сквозь них (например, если окно перекрывало инвентарь и невозможно было нажать на нужную кнопку)",
        "Теперь телепорт ближайшего транспорта рядом с игроком через команду /trp игнорирует наводные судна",
        "Исправлен баг, когда не работали некоторые специальные админ-формы (/setgangzone, /removetune и т.п.)",
        "Вкладка «Правила» переехала во влкадку «Админ ПО», а на её место помещена вкладка «VIP Чат», о которой мы расскажем уже совсем скоро, в обновлении 1.17.1",
        "Исправлена некорректная работа команды /removeitem при удалении слотов в диапазоне",
        "Исправлена некорректная работа команды /flymode",
        "Прочие незначительные изменения (их очень много)"
    ],
    "servers": [
        { "address": "185.169.134.3:7777", "id": 1 },
        { "address": "185.169.134.4:7777", "id": 2 },
        { "address": "185.169.134.43:7777", "id": 3 },
        { "address": "185.169.134.44:7777", "id": 4 },
        { "address": "185.169.134.45:7777", "id": 5 },
        { "address": "185.169.134.5:7777", "id": 6 },
        { "address": "185.169.134.59:7777", "id": 7 },
        { "address": "185.169.134.61:7777", "id": 8 },
        { "address": "185.169.134.107:7777", "id": 9 },
        { "address": "185.169.134.109:7777", "id": 10 },
        { "address": "185.169.134.166:7777", "id": 11 },
        { "address": "185.169.134.171:7777", "id": 12 },
        { "address": "185.169.134.172:7777", "id": 13 },
        { "address": "185.169.134.173:7777", "id": 14 },
        { "address": "185.169.134.174:7777", "id": 15 },
        { "address": "80.66.82.191:7777", "id": 16 },
        { "address": "80.66.82.190:7777", "id": 17 },
        { "address": "80.66.82.188:7777", "id": 18 },
        { "address": "80.66.82.168:7777", "id": 19 },
        { "address": "80.66.82.159:7777", "id": 20 },
        { "address": "80.66.82.200:7777", "id": 21 },
        { "address": "80.66.82.144:7777", "id": 22 },
        { "address": "80.66.82.132:7777", "id": 23 },
        { "address": "80.66.82.128:7777", "id": 24 },
        { "address": "80.66.82.113:7777", "id": 25 },
        { "address": "80.66.82.162:5125", "id": 101 },
        { "address": "80.66.82.148:5125", "id": 102 },
        { "address": "80.66.82.136:5125", "id": 103 },
        { "address": "80.66.82.147:7777", "id": 1000 }
    ],
    "files": {
        "gps": 11,
        "gps_vc": 5,
        "questions": 5,
        "server_cmd": 3,
        "admin_cmd": 5,
        "vehicles": 8,
        "skins": 4
    },
    "api_url": "https://api.arztools.tech/"
}