{
    "latest": 76,
    "version": "1.18 Release",
    "updateurl":"https://raw.githubusercontent.com/aziatka/admin_app_release/main/Arizona%20RP/arztools.luac",
    "patch_load": true,
    "critical": false,
    "event": false,
    "changes": [
        "Переделана система выдачи офлайн форм. Мы учли все баги и недочёты старой системы и сделали совершенно новую и удобную для старшей администрации систему",
        "Добавлена система запроса опровержений со слётов. Теперь запрашивать опровержения на пойманный с госа дом, автомобиль или бизнес станет в разы проще",
        "Добавлена команда для получения информации о последнем /ao. Введя новую команду /aolast скрипт покажет вам, кто и когда отправлял последнее сообщение в общий чат. Больше никаких вопросов по типу: «АО занято?»",
        "Улучшено меню взаимодействия с игроками или транспортом по клику. Мы постарались исправить все его недочёты и сделали его более приятным на вид",
        "Полностью обновлено телепорт-меню. Множество разделов, приятный внешний вид и адаптация к Vice-City уже ждёт вас!",
        "Улучшена система выбора спавна после авторизации. Теперь вы можете выбрать один из 4 вариантов мест, где вы будете появляться после авторизации в /apanel",
        "Добавлена система варнингов на рак-ботов. Данная система поможет с лёгкостью вычислять ботов-фермеров или ботов, которые просто качают уровни на спавнах",
        "Система биндера была обновлена как внешне так и внутренне. Были добавлены новые возможности выбора условий для запуска бинда, изменён внешний вид окна редактирования, а так же удалён раздел AO оповещений. Но не стоит переживать, все оповещения который у вас были до этого сохранены, мы перенесли в обычный биндер",
        "Добавлена команда /vkchat для быстрого получения ссылки на нашу беседу Вконтакте, где можно общаться напрямую с разработчиками, узнавать самые свежие новости проекта из первых уст и тестировать новые обновления раньше других",
        "Добавлена новая команда /cauth, которая позволяет узнать число неавторизованных игроков на сервере",
        "Теперь в /checkpunish наказания, выданные вами, выделяются другим цветом",
        "Добавлены некоторые улучшения в меню выдачи бизнесов для мафий, а так же убрано вступление во фракцию при анализе бизнесов",
        "Добавлена новая команда - /findtext [Text] для поиска 3D-Текста рядом с вами. Например, если вам нужно быстро найти владельца лавки на Центральном Рынке, то вместо того чтобы подбегать к каждой, и смотреть кто её арендует, вы можете прописать /findtext *Имя владельца* и скрипт найдет наиболее похожий текст среди всех что есть рядом с вами и укажет меткой на него меткой",
        "Теперь при отправке формы /setname после формы будет выводиться подсказка о том, какой ник у игрока в данный момент",
        "Немного обновлён раздел информации о скрипте, добавлены новые ссылки",
        "Анти-флуд больше не реагирует на сообщения от администраторов",
        "Добавлены команды /addadm(in) и /deladm(in), для бстрого добавления старшей администрации в чекер (5+ уровней)",
        "Добавлена команда /anote для быстрой установки/очистки заметки администратору в чекере",
        "Добавлена новая команда /myip для быстрого получения своего текущего IP-адреса",
        "Добавлена подсказка о команде /faminviteunix, если вы хотите принять игрока в семью, а у него в этот момент действует КД на вступление (24 часа)",
        "Добавлена функция «Отключение эффектов» для повышения FPS, которая отключает некоторые требовательные игровые эффекты (дым, пыль из под колёс, дымка и т.д.). По умолчанию не работает, включить можно в основных настройках.",
        "Улучшена логика подбора актуальной жалобы при включенной старой системе репорта (без очереди)",
        "Для команд /slap и /slapcar добавлен новый необязательный аргумент - количество раз, которое нужно слапнуть. Например: «/slap 666 1 5» подкинет игрока 5 раз вверх",
        "Обновлён кастомный Wall-Hack. Теперь он работает на любой дистанции, а стандартный ник при этом будет отключаться. Так же немного изменён его стиль",
        "Ранее, если флуд-контроль был настроен, например, на 60 секунд и приходило повторное сообщение, написанное спустя 60 секунд, то он срабатывал. Теперь это исправлено.",
        "Исправлена проблема, когда тулс не отвечал ошибкой в админ-чат на некорректную форму /rmute",
        "Команда /bank теперь является простым сокращением /abankmenu и не телепортирует вас в виртуальный мир при её использовании",
        "Внесены некоторые корректировки в работу команды /disconnect",
        "Теперь команда /arz не сработает, если вы используете её на основном сервере",
        "Исправлен баг, когда некоторые команды, написанные капсом, не принимались обработчиком и скрипт их игнорировал (например /VC или /BANK)",
        "Задержка при выдаче наказаний через /pbanip увеличена до одной секунды",
        "Исправлен баг, когда после обновления списка GPS не подгружались добавленные пользователем пункты до момента пока не произойдет перезагрузка скрипта",
        "В /netlog добавлена возможность скопировать строку одним нажатием",
        "Проведен рефакторинг всплывающих подсказок",
        "Добавлено 3 новых промо-сообщения, которые будут писаться в чат в рандомном порядке раз 1-2 часа",
        "Исправлен баг, когда нельзя было изменить акцентный цвет сообщения о новом репорте в чате (не открывалась палитра)",
        "Исправлены некорректные показания команды /gettime",
        "Список стандартных скинов удален из кода скрипта и перенесен в JSON (вместе к кастомным моделям скинов)",
        "В списке админ-форм команда /uvaloff перенесена на 4 уровень",
        "В форму отправки баг-репорта добавлен пункт «Доказательство»",
        "Теперь при поиске по всем разделам в правилах также показывается название раздела из которого найдена строка",
        "В список админ-форм добавлена команда /adelattach (с 3 уровня)",
        "Теперь в моменте, когда у вас заглохнет двигатель или закончится топливо в машине, тулс подскажет, что можно использовать команду repcar или /fillcar",
        "Исправлена ошибка, когда скрипт мог установить вам визуальные деньги игрока, чью статистику вы открыли вне слежки",
        "Исправлен баг, когда не считались выданные наказания в статистике",
        "Теперь команда /abot, введённая без аргументов, завершает проверку на ботов",
        "Исправлена проблема, когда курсором в реконе нельзя было нажимать на различные чекеры на экране",
        "Теперь флуд контроль, как и раньше, учитывает рекламные сообщения в вип-чате",
        "На переход к следующему/предыдущему, игроку в слежке через кнопку (стрелку), а так же на переход в слежку за рандомным игроком, добавлено КД (т.к. слишком быстрое использование приводило к кику с сервера)",
        "Теперь расформирование гетто-зон через /ghetto будет происходить моментально, если ваш уровень 5 и выше",
        "Теперь, администраторы в килл-листе отображаются с тегом [A]",
        "Исправлен баг, когда автоматическое взятие админ-квестов не срабатывало при ручной авторизации в /apanel",
        "Команда /plveh теперь поддерживает выдачу транспорта по названию.",
        "Исправлен баг, когда нельзя было использовать /sskin 0 после выдачи визуального скина через /admhelp - Скины",
        "Для чекера игроков рядом (/near) добавлена два новых вида сортировки: по расстоянию и по скорости передвижения",
        "Исправлен баг, когда формы написанные КАПСОМ могли не распознаваться и игнорироваться",
        "Исправлен визуальный баг при открытии окна /getip",
        "Теперь горячая клавиша сбива анимации, находясь в транспорте, работает как восстановление на колёса (аналог /flip)",
        "Исправлена недоработка, когда глобальный курсор или курсор в реконе можно было активировать “поверх“ основного курсора и иногда это вводило в заблуждение",
        "Исправлен краш при вводе /agun без аргументов",
        "Исправлен краш скрипта при невозможности выполнить какой-либо не асинхронный запрос",
        "Исправлен баг, когда игрок/админ который вышел с сервера оставался в чекере",
        "На форму /uval теперь не срабатывает пред-рекон",
        "Исправлена работа команды /nick, если она была введена без аргумента",
        "Внесено несколько незначительных улучшений в режим рулетки клик-варпа",
        "Исправлен баг в окне ответа на репорт, когда в поле вопроса ничего не отображалось, если текст репорта состоял только из чисел",
        "Исправлены некоторые незначительные логические проблемы при попытке пропустить репорт, а так же изменен дизайн этого окна",
        "Переписана логика поиска и выделения потенциальных ID игроков в тексте репорта. Она исправляет баг с неправильной (в некоторых случаях) расстановкой ID и оптимизирует FPS при открытом окне репорта с большим текстом жалобы.",
        "Исправлен баг, когда ответ на репорт не отправлялся, если на сервере была включена старая система репорта (без очереди)",
        "Исправлена проблема, когда вопрос под ответом на репорт в чате отправлялся не сразу и это могло выглядеть коряво в некоторых случаях",
        "Теперь если игрок вышел, то при нажатии на его ник в килл-листе он будет копироваться",
        "Изменены местами действия копирования ника и открытия статистики игрока в окне информации при слежке. Теперь при нажатии на ник, он будет копироваться, а кнопка рядом с ником будет отвечать за открытие статистики.",
        "Теперь линии к игрокам и рендер скелетов будет работать всегда, независимо от того, виден ли ник игрока или нет.",
        "Линии к игрокам теперь рисуются не от игрока, а от центра экрана сверху. Так же добавлена поддержка работы в реконе",
        "Исправлен баг, когда статистика игрока могла сбить репорт при переходе в слежку за игроком с открытым окном ответа на репорт",
        "Исправлен баг, при котором чекер игроков не реагировал на нажатия курсором",
        "Исправлено ложное срабатывание варнинга на рванку если игрок стоит на крыше транспорта",
        "Вырезаны команды /cbiz и /chouse (всвязи с нововведениями в системе ловли)",
        "Удалены лишние дебаг-сообщения из консоли",
        "Удалена команда /afind"
    ],
    "servers": [
        { "address": "185.169.134.3:7777", "id": 1 },
        { "address": "185.169.134.4:7777", "id": 2 },
        { "address": "185.169.134.43:7777", "id": 3 },
        { "address": "185.169.134.44:7777", "id": 4 },
        { "address": "185.169.134.45:7777", "id": 5 },
        { "address": "185.169.134.5:7777", "id": 6 },
        { "address": "185.169.134.59:7777", "id": 7 },
        { "address": "185.169.134.61:7777", "id": 8 },
        { "address": "185.169.134.107:7777", "id": 9 },
        { "address": "185.169.134.109:7777", "id": 10 },
        { "address": "185.169.134.166:7777", "id": 11 },
        { "address": "185.169.134.171:7777", "id": 12 },
        { "address": "185.169.134.172:7777", "id": 13 },
        { "address": "185.169.134.173:7777", "id": 14 },
        { "address": "185.169.134.174:7777", "id": 15 },
        { "address": "80.66.82.191:7777", "id": 16 },
        { "address": "80.66.82.190:7777", "id": 17 },
        { "address": "80.66.82.188:7777", "id": 18 },
        { "address": "80.66.82.168:7777", "id": 19 },
        { "address": "80.66.82.159:7777", "id": 20 },
        { "address": "80.66.82.200:7777", "id": 21 },
        { "address": "80.66.82.144:7777", "id": 22 },
        { "address": "80.66.82.132:7777", "id": 23 },
        { "address": "80.66.82.128:7777", "id": 24 },
        { "address": "80.66.82.113:7777", "id": 25 },
        { "address": "80.66.82.162:5125", "id": 101 },
        { "address": "80.66.82.148:5125", "id": 102 },
        { "address": "80.66.82.136:5125", "id": 103 },
        { "address": "80.66.82.147:7777", "id": 1000 }
    ],
    "files": {
        "gps": 16,
        "gps_vc": 5,
        "questions": 7,
        "server_cmd": 3,
        "admin_cmd": 5,
        "vehicles": 8,
        "skins": 5,
        "giveoff": 6
    },
    "api_url": "https://api.arztools.tech/"
}